{"metadata": {"processed_count": 20, "processing_time_seconds": 6.864101886749268, "timestamp": "2025-03-17 19:14:30"}, "articles": {"1": {"title": "Honoring the legacy of Emily Warren Roebling, who helped build the Brooklyn Bridge", "summary": "Celebrating Emily Warren Roebling, unsung hero of the construction of the Brooklyn Bridge\n\nCelebrating Emily Warren Roebling, unsung hero of the construction of the Brooklyn Bridge\n\nCelebrating Emily Warren Roebling, unsung hero of the construction of the Brooklyn Bridge\n\nWoven into the beams and towers of the Brooklyn Bridge is the story of a woman who was up for a challenge.\n\nEmily Warren Roebling was the wife of Washington Roebling, the chief engineer of the Brooklyn Bridge.\n\nWhen Washington became disabled due to decompression sickness during construction, Emily took over the project and brought it across the finish line.\n\n\"She did everything from managing construction, managing the workers, facilitating conversations with politicians who also did not want him to continue the project because they called him an invalid,\" said Natiba Guy-Clement, director of special collections at the Brooklyn Public Library's Center for Brooklyn History.\n\nRoebling family history\n\nThe historic library houses a collection of artifacts about the Roeblings.\n\n\"Being one of 12 kids, being the daughter of a politician, I think that she just had to have that level of empowerment within herself,\" Guy-Clement said.\n\nHistorians say Emily met Washington, son of bridge designer John Roebling, at a ball. They immediately fell in love and were soon married.\n\nThat union created a family tree that continues with Kriss Roebling, their great-great-grandson.\n\nAs he recently walked along the bridge with CBS News New York's Hannah Kliger, he stopped by the monument honoring his family's contributions -- a monument his father helped unveil as a teenager in the 1950s.\n\n\"It was the first time anything on the bridge mentioned that she was involved in any way,\" he said. \"At the time [it] was unheard of, that a woman would be responsible for all of the on-site engineers for such an ambitious building project. This was hands down the most ambitious and extreme building project of modern times.\"\n\nEmily Roebling honored in Brooklyn Bridge Park\n\nUnderneath the Brooklyn tower of the bridge is Emily Warren Roebling Plaza.\n\n\"A big piece of the design on the ground mimics the bridge above it,\" said Eric Landau, president of Brooklyn Bridge Park.\n\nUnveiled in 2021, the public green space is now used to see the engineering marvel up close.\n\n\"In fact, it was a suggestion from members of the community that we do something to honor her and her legacy,\" Landau said.\n\nAt the opening ceremony of the Brooklyn Bridge in 1883, she was the first to drive across the span with a rooster, as a sign of victory, proving that barriers are meant to be broken.\n\nRoebling then went on to study and receive a law degree, making her among the first female lawyers in New York state.\n\n\"She got a degree from NYU, and she utilized it to start a series of organizations that helped facilitate other women's capacities to have careers,\" Kriss Roebling said.\n\nHer achievements and determination didn't just shape the skyline.\n\nThis Women's History Month, it also helped pave the way for women in engineering, law, and beyond.\n\nHave a story idea or tip in Brooklyn? Email Hannah by CLICKING HERE.", "link": "https://www.cbsnews.com/newyork/news/honoring-the-legacy-of-emily-warren-roebling-who-helped-build-the-brooklyn-bridge/", "timestamp": "2025-03-17 19:10:24 EDT", "success": true}, "2": {"title": "Unknown Title", "summary": "Error parsing article content", "link": "https://www.nytimes.com/2025/03/17/world/americas/peruvian-fisherman-95-days-lost-at-sea.html", "timestamp": "2025-03-17 19:04:59 EDT", "success": false, "error": "Article `download()` failed with 403 Client Error: Forbidden for url: https://www.nytimes.com/2025/03/17/world/americas/peruvian-fisherman-95-days-lost-at-sea.html on URL https://www.nytimes.com/2025/03/17/world/americas/peruvian-fisherman-95-days-lost-at-sea.html"}, "3": {"title": "My Take | Will AI and robots drive China’s next consumer spending spree?", "summary": "China published a new action plan last Sunday aimed at boosting consumer spending, and the immediate question for many observers was whether this “spend, spend, spend” initiative will be effective this time around.\n\nAdvertisement\n\nHistorically, China has pursued strategies to stimulate domestic spending since the late 1990s, when the country began producing more goods than it could consume or export. Two primary schools of thought have emerged on how to encourage increased spending.\n\nThe first focuses on the demand side, which asserts that as people’s incomes rise, their spending tends to increase accordingly. Proponents of this approach advocate for steady growth in household incomes and national income distribution. During China’s annual parliamentary gathering in March, there were plenty of proposals for cutting personal income tax.\n\nThe second perspective emphasises the supply side of consumer spending. This suggests that the average disposable income of Chinese residents has been rising in tandem with economic growth. According to official data, the per capita disposable income in China grew by 5.3 per cent in 2024, aligning with a gross-domestic-product growth of 5 per cent.\n\nThat viewpoint posits that Chinese households have already accumulated sufficient spending power, and the key to boosting consumption lies in providing attractive products and services that would encourage consumers to open their wallets.\n\nA family walks past a shopping centre in Beijing. Photo: AFP\n\nBeijing has attempted to address both perspectives in its consumption strategies. But in practice, it often leans toward supply-side initiatives, which do not involve difficult structural reforms.", "link": "https://www.scmp.com/opinion/china-opinion/article/3302709/will-ai-and-robots-drive-chinas-next-consumer-spending-spree?utm_source=rss_feed", "timestamp": "2025-03-17 19:00:09 EDT", "success": true}, "4": {"title": "Trump claims Biden's pardons for Jan. 6 committee are 'void.' Legal experts disagree", "summary": "He alleged, without evidence, that they invalid because signed by autopen.\n\nPresident Donald Trump takes a question from a reporter before boarding Air Force One as he departs from Joint Base Andrews in Maryland, Mar. 14, 2025.\n\nPresident Donald Trump takes a question from a reporter before boarding Air Force One as he departs from Joint Base Andrews in Maryland, Mar. 14, 2025.\n\nPresident Donald Trump takes a question from a reporter before boarding Air Force One as he departs from Joint Base Andrews in Maryland, Mar. 14, 2025.\n\nPresident Donald Trump takes a question from a reporter before boarding Air Force One as he departs from Joint Base Andrews in Maryland, Mar. 14, 2025.\n\nPresident Donald Trump is taking aim at one of his predecessor's final acts in office: preemptive pardons for members of the House Jan. 6 select committee.\n\nIn a late-night social media post, Trump claimed without evidence President Joe Biden used an autopen to sign the pardons and so he considered them \"hereby declared VOID, VACANT, AND OF NO FURTHER FORCE OR EFFECT.\"\n\nTrump, who made retribution against his perceived political enemies a focal point of his 2024 campaign, said the committee members should \"fully understand that they are subject to investigation at the highest level\" despite no findings of wrongdoing.\n\nDespite his claims, legal experts told ABC News that Trump does not have the power to overturn Biden's actions.\n\nA president's clemency power is vested in Article II of the Constitution and is \"broad and virtually unlimited,\" said Jeffrey Crouch, an assistant professor at American University and expert on presidential pardons.\n\nIts few restrictions include that it can only apply to federal offenses and can't interfere with the impeachment powers of Congress.\n\nPresident Donald Trump speaks to reporters watched by National Security Advisor Mike Waltz aboard Air Force One on his return to Washington, Mar. 16, 2025. Kevin Lamarque/Reuters\n\nIn 1929, a memo by the solicitor general to the attorney general on pardons held that \"neither the Constitution nor any statute prescribes the method by which Executive clemency shall be exercised or evidenced.\"\n\n\"It is wholly a matter for the President to decide, as a practical question of administrative policy,\" the department said. \"Nobody but the President can exercise the power, but the power having been exercised the method of making a record and evidence thereof is a mere detail which he can prescribe in accordance with what he deems to be the practical necessities and proprieties of the situation.\"\n\nThe memo was cited in a federal appeals court ruling just last year that said pardons don't necessarily have to be in writing.\n\nAnd while autopens (mechanical devices used to automatically add a signature to a document) have come under scrutiny in the past, the Justice Department as recently as 2005 determined they were constitutional and could be used for a president to sign a bill into law in a study commissioned by then-President George W. Bush.\n\nFormer President Barack Obama used an autopen to extend the Patriot Act, avert a fiscal crisis and more during his administration. Other presidents, including Lyndon B. Johnson and John F. Kennedy, are also documented as having used the device or one similar.\n\n\"If the autopen is illegal, then many of the actions and regulations that presidents have done for the past four or five decades are null and void. It's a ridiculous argument,\" said Elaine Kamarck, a senior fellow of governance studies at the Brookings Institution.\n\n\"There is nothing in the Constitution that requires that a pardon must be signed without an autopen. Obviously, that is a 20th century invention, and earlier presidents had no access to such technology. Nonetheless, Trump has zero authority to undo a Biden pardon, just as the next president has no authority to undo Trump's pardons,\" said Michael Gerhardt, a constitutional law expert at the University of North Carolina.\n\nABC News has inquired with Biden’s team and the current White House to learn more about their autopen usage but has not received comment.\n\nPresident Joe Biden delivers his farewell address to the nation from the Oval Office of the White House in Washington, Jan. 15, 2025. Mandel Ngan/POOL/AFP via Getty Images\n\nAboard Air Force One late Sunday, Trump was asked if any executive order or action from Biden that included an autopen would be considered null.\n\n\"It's not my decision, that'll be up to a court,\" Trump responded, \"but I would say that they're null and void because I'm sure Biden didn't have any idea that it was taking place, and somebody was using an autopen to sign off and to give pardons.\"\n\nWhite House press secretary Karoline Leavitt also suggested, without evidence, that Biden was unaware of his signature being affixed to the pardons.\n\n\"Was his legal signature used without his consent or knowledge?\" Leavitt said during Monday's briefing.\n\nAsked specifically if attorneys at the White House told Trump he has the legal authority to undo a pardon because it was signed by autopen, Leavitt said Trump was just \"begging the question that I think a lot of journalists in this room should be asking.\"\n\nBiden issued the eleventh-hour pardons just hours before Trump's inauguration. He spoke several times in his final media interviews about how he was considering such an option for people he feared could be targeted in the next administration, such as Liz Cheney or Anthony Fauci.\n\nWhat would happen if Trump tried to ignore or challenge Biden's action?\n\n\"It could open a Pandora's box if a sitting president tried to undo a pardon by one of their predecessors. The better rule would be that pardons -- whether perceived as 'good' or 'bad' decisions -- should be final,\" said Crouch.\n\nABC News' Molly Nagle and Nicholas Kerr contributed to this report.", "link": "https://abcnews.go.com/Politics/trump-claims-bidens-pardons-jan-6-committee-void/story?id=119877843", "timestamp": "2025-03-17 18:58:58 EDT", "success": true}, "5": {"title": "Trump's World Liberty Financial crypto project says it sold $550 million in tokens", "summary": "The World Liberty Financial website arranged on a smartphone in New York, US, on Wednesday, Feb. 12, 2025.\n\nPresident Donald Trump's World Liberty Financial crypto project said on Monday that it raised $250 million in its second token sale, bringing the total amount of coins sold to $550 million.\n\nWLFI, a venture backed by the first family that describes itself as a sort of crypto banking platform, launched in October, weeks before Trump's election victory. In a document published at the time of launch, WLFI said the Trump family could take home 75% of net revenue.\n\nIn Monday's release, WLFI said more than 85,000 participants underwent so-called know-your-customer verification to gain access to the token sale. Co-founder Zach Witkoff, son of billionaire U.S. envoy Steve Witkoff, is quoted in the release as saying that \"WLFI is on track to supercharge DeFi,\" or decentralized finance.\n\nIn January, Tron blockchain founder Justin Sun upped his stake in WLFI tokens to $75 million. A court filing the following month showed that Sun and the SEC were exploring a resolution to the regulator's civil fraud case against the crypto entrepreneur.\n\nWLFI is one of several crypto projects in the Trump family that are kicking off just as the president is pushing a crypto-friendly agenda. Earlier this month, President Trump signed an executive order to establish a Strategic Bitcoin Reserve.\n\nAccording to a memo from the White House last week, David Sacks, the Trump administration's AI and crypto czar, sold over $200 million worth of digital asset-related investments personally and through his firm, Craft Ventures, before starting the job. Sacks said in a podcast that he \"didn't want to even have the appearance of a conflict.\"\n\nAt the end of February, the SEC declared that meme tokens are not securities. The announcement came after the president and First Lady Melania Trump launched their own meme coins in the days leading up to the inauguration.\n\nWATCH: Trump's bitcoin reserve leaves crypto investors disappointed", "link": "https://www.cnbc.com/2025/03/17/trump-world-liberty-financial-crypto-sold-550-million-in-tokens.html", "timestamp": "2025-03-17 18:58:22 EDT", "success": true}, "6": {"title": "Unknown Title", "summary": "Error parsing article content", "link": "https://www.nytimes.com/2025/03/17/us/politics/abortion-arrest.html", "timestamp": "2025-03-17 18:57:33 EDT", "success": false, "error": "Article `download()` failed with 403 Client Error: Forbidden for url: https://www.nytimes.com/2025/03/17/us/politics/abortion-arrest.html on URL https://www.nytimes.com/2025/03/17/us/politics/abortion-arrest.html"}, "7": {"title": "NOAA's Storm Prediction Center facility among planned DOGE cuts", "summary": "The \"building lease issue is in flux,\" a NOAA spokesperson said.\n\nDespite the deadly storms over the weekend, one of the core government facilities tracking severe thunderstorms and tornadoes, is listed on the website of Elon Musk's Department of Government Efficiency as one with a planned office closure.\n\nThe Storm Prediction Center -- one of several entities housed at the National Weather Center in Norman, Oklahoma -- issues severe weather forecasts across the nation and identifies threat zones where dangerous thunderstorms and tornadoes could move through days in advance.\n\nA spokesperson with the National Oceanic and Atmospheric Administration -- the federal agency that studies and reports on the oceans, atmosphere and coasts as well as oversees the Storm Prediction Center as well as the National Weather Service -- confirmed that the \"building lease issue is in flux.\"\n\nFire burns a residence during a wildfire outbreak in Stillwater, Oklahoma, Mar. 14, 2025. Nick Oxford/Reuters\n\nWith this latest storm, the Storm Prediction Center began alerting about a potential significant severe weather event across parts of the Midwest and South several days ahead of the first tornadoes. The center also tracks which parts of the country could face critical to extreme fire weather conditions -- as Oklahoma, where the center is located, remains under alert for fire danger after being devastated by deadly blazes over the weekend.\n\nAt least 40 people were killed amid more than 970 severe storm reports across more than two dozen states over the weekend. A three-day tornado outbreak tore through at least nine states.\n\nDestruction from a severe storm is seen Mar. 15, 2025, in Wayne County, Mo. Jeff Roberson/AP\n\nFire burns a residence during a wildfire outbreak in Stillwater, Oklahoma, Mar. 14, 2025. Nick Oxford/Reuters\n\nRepublican Rep. Tom Cole claims that he intervened and that the center in Norman will not lose its lease.\n\n\"I am so proud to have advocated for them. As the Representative for Oklahoma's Fourth District, I will always fight for Oklahomans and my constituents!\" Cole wrote in a release last week.\n\nElon Musk arrives for US President Donald Trump's address to a joint session of Congress in the House Chamber of the Capitol in Washington, Mar. 4, 2025. Saul Loeb/AFP via Getty Images\n\nBut the building is still listed, along with hundreds of others, as a target of DOGE's cuts.\n\nABC News has reached out to the White House for comment.\n\nHouse Appropriations Committee Chairman Tom Cole responds to questions from the House Rules Committee as the panel prepares a spending bill that would keep federal agencies funded through Sept. 30, in Washington, Mar. 10, 2025. J. Scott Applewhite/AP\n\nWhen the General Services Administration briefly listed office leases it planned to terminate a few weeks ago, the NOAA locations sent shockwaves through the scientific community especially with tornado season (and hurricane season) coming up.\n\nThe Norman facility has, according to local outlets, been impacted by some staffing cuts.\n\nOnline the center boasts of some 500 scientists, engineers, meteorologists and climatologists from NOAA, the University of Oklahoma and state agencies. It specializes in storm prediction and advancing radar technology.\n\n\"We serve as a national resource for severe weather research and work collaboratively with the National Weather Service to ensure that their forecasters have the knowledge, capabilities, and technologies to remain world leaders in effectively communicating accurate, timely, and actionable forecasts and warnings of extreme weather to the public and commerce,\" their mission statement reads.\n\nABC News has reached out to local Oklahoma lawmakers for comment, but hasn't heard back by the time of publication.", "link": "https://abcnews.go.com/Politics/noaas-storm-prediction-center-facility-planned-doge-cuts/story?id=119882272", "timestamp": "2025-03-17 18:54:56 EDT", "success": true}, "8": {"title": "Net Zero by 2050 'impossible' for UK, says Kemi Badenoch", "summary": "Net zero by 2050 'impossible' for UK, says Badenoch\n\n19 minutes ago Share Save Sam Francis Political reporter Share Save\n\nPA Media\n\nKemi Badenoch has said it is \"impossible\" for the UK to meet its net zero target by 2050 - a goal set by a previous Conservative government. The UK is legally committed to reaching net zero by 2050 under a law passed by Theresa May in 2019. It means the UK must cut carbon emissions until it removes as much as it produces, in line with the 2015 Paris Climate Agreement. Badenoch said net zero cannot be achieved by 2050 \"without a serious drop in our living standards or by bankrupting us\". The Conservative leader did not set out a replacement for the target, but her words mark a sharp break from years of political consensus.\n\nA source close to Badenoch said the Conservative leader still backs net zero, but not by 2050. In a preview of a speech on Tuesday, Badenoch called lower energy costs and environmental protection \"noble aims\" but said current policies were \"largely failing\" to improve nature, while raising energy prices. She said: \"We're falling between two stools - too high costs and too little progress. \"Net zero by 2050 is impossible. \"I don't say that with pleasure. Or because I have some ideological desire to dismantle it - in fact, we must do what we can to improve our natural world.\" She will say she is not making a \"moral judgment\" on net zero or debating whether climate change exists. But she said her Tory party is going to \"deal with the reality\" of the target, something she argues Labour and past Conservative governments ignored. Badenoch's speech kicks off a new chapter in her leadership, launching an overhaul of Conservative policies - starting with energy and net zero. Badenoch won her party's leadership on a promise to return the Conservatives to \"first principles\" before setting out detailed policies. In her speech, Badenoch will announce details of a \"policy renewal programme\" - putting each of her shadow cabinet in charge of a policy area.\n\nBadenoch's comments come as governments worldwide are investing in renewables to meet international climate targets and lower carbon emissions to net zero by 2050. The UN and Intergovernmental Panel on Climate Change (IPCC) have warned that global CO2 emissions must reach net zero by then to limit global temperature rises to 1.5C. Target areas for cutting emissions include: reducing air travel\n\nminimising energy use\n\nimproving home insulation and energy efficiency\n\nswitching to electric vehicles\n\nreplacing gas central heating with electric systems such as heat pumps\n\ncutting consumption of red meat Labour is expanding renewable energy and said in its election manifesto it would invest £8.3bn in Great British Energy, a state-owned clean energy company, over five years. Electricity is increasingly generated from renewable energy in the UK, and the cost of renewable generation has significantly fallen in the past decade. Labour promised to bring down household energy bills by \"up to £300 by 2030\" - and Energy Secretary Ed Miliband has stood by the pledge. But UK energy bills went up in January, and are expected to rise again in April. The main reason for high energy prices in the UK has been an increase in the price of gas, which has been the largest source of fuel for years.\n\nA Labour spokesperson said: \"Kemi Badenoch claims she's ready to 'deal with reality' while remaining in complete denial about the reality of the Tories' appalling record in government. \"The Tory leader's position is at odds with her own historic views. In government, she openly championed net zero. \"It's clear the Conservatives stand for nothing and have learned absolutely no lessons. They haven't changed.\" As a minister, Badenoch promoted the 2050 target as \"crucial\" to \"achieve a cleaner, green future\". Some Conservative voices criticised her latest move. Sam Hall, Director of the Conservative Environment Network, called it a \"mistake\" and argued Badenoch's speech \"undermines the significant environmental legacy of successive Conservative governments\". He said Badenoch was right to criticise Labour's approach, but argued \"the net zero target is driven not by optimism but by scientific reality; without it climate change impacts and costs will continue to worsen\". But Lord Craig Mackinlay, a Conservative peer and net zero sceptic, praised Badenoch's \"reality check\" on the 2050 target. \"Most of the world has already given up any pretence that it is affordable or achievable,\" said Lord Mackinlay, founder of the Net Zero Scrutiny Group. \"Intermittent renewables that only stack up on the back of buckets of taxpayer cash are not the answer when we need cheap, reliable and secure energy.\"", "link": "https://www.bbc.com/news/articles/cly3pnjyzp4o", "timestamp": "2025-03-17 18:55:05 EDT", "success": true}, "9": {"title": "Trump administration updates: Officials question court's authority over deportations", "summary": "Shortly after Trump’s border czar Tom Homan flat out stated he didn't \"care\" what judges thought, Stephen Miller, Trump’s deputy chief of staff for policy, questioned the authority of a district court judge to rule over the president's immigration policies.\n\nI asked Miller if this administration believes it needs to comply with a verbal court order. He took it one step farther.\n\n“The American people said, to get these terrorist gangs the hell out of our country. The President has plenary authority under the Constitution, under the Alien Enemies Act, under the IMA, under core article, two powers to achieve that and no district court judge, who presides over to some small like little geography of the whole country could possibly presume to have the authority to direct the expulsion of terrorists from our soil, who by the way are also here illegally,” he stated, calling the order “patently unlawful.”\n\nDeputy White House chief of staff Stephen Miller speaks to reporters at the White House in Washington, Mar. 17, 2025. Ben Curtis/AP\n\nThe White House has not provided the names of the alleged gang members who were deported or any substantial evidence of the crimes they committed in the United States.\n\nI asked Miller why the White House has released images and videos of the people they deported but has not released their names. He cited \"operational security” reasons.\n\n\"Well, they are actually foreign terrorists and alien enemies the United States and everything that we do is for operational security reasons. We are dealing with one of the most dangerous terrorist organizations on planet Earth,\" he said.\n\nHe added, \"They're even more ruthless and violent than MS-13, and so operational security and public safety and national security always going to guide any decisions that are made in this regard.\"\n\n-ABC News’ Rachel Scott", "link": "https://abcnews.go.com/Politics/live-updates/donald-trump-second-term/?id=119864095", "timestamp": "2025-03-17 18:53:40 EDT", "success": true}, "10": {"title": "DOJ seeks to boot judge questioning Trump deportations, lawyer warns of 'constitutional crisis'", "summary": "U.S. President Donald Trump speaks to the media during a guided tour of the John F. Kennedy Center for the Performing Arts before leading a board meeting on March 17, 2025 in Washington, DC.\n\nThe Department of Justice on Monday asked a federal appeals court in Washington, D.C., to replace the district court judge overseeing a case challenging the Trump administration's deportations of hundreds of alleged Venezuelan gang members to El Salvador under the wartime Alien Enemies Act.\n\nThe request, which cited Chief James Boasberg's alleged \"inappropriate exercise of jurisdiction,\" came as Boasberg conducted a hearing where he pressed a top-ranking DOJ lawyer about the circumstances of the deportations conducted over the weekend.\n\nThe DOJ earlier Monday asked Boasberg without success to cancel that hearing.\n\nBoasberg in an oral order on Saturday had told the DOJ to order the return of any deportees who were still airborne on flights that originated in the United States.\n\nThe DOJ in a court filing claimed that \"an oral directive is not enforceable at a directive,\" and said that it had complied with Boasberg's written order issued hours later blocking any more deportation flights of Venezuelans.\n\nDeputy Associate Attorney General Abhishek Kambli told Boasberg on Monday that he was not at liberty to talk about details of the controversial deportation flights in a public setting in U.S. District Court in Washington.\n\nAt the same hearing, a lawyer for five Venezuelan men who sued to challenge their feared deportations told Boasberg that he wanted to be careful about his language, but said, \"There has been a lot of talk the last couple of weeks about a constitutional crisis.\"\n\n\"I think we're getting very close to that,\" said Gelernt, who argues that two deportation flights took off from the United States after Boasberg's oral order.\n\nGelernt appeared to be referring to Kambli's refusal to answer questions by the judge about the flights, and to the Trump administration's argument that the deportations under the Alien Enemies Act were not subject to judicial order after the flights left U.S. airspace.\n\n\"It doesn't matter if you're in U.S. airspace or not,\" Boasberg said during Monday's hearing.", "link": "https://www.cnbc.com/2025/03/17/trump-deportation-order-venezuela-gang-judge-alien-enemies.html", "timestamp": "2025-03-17 18:53:15 EDT", "success": true}, "11": {"title": "Jalen Rose reacts to UNC's controversial tournament bid: 'San Diego State are going to knock them out anyway'", "summary": "Controversy swirls around the NCAA Tournament Selection Committee each year, as one or two teams get debated about whether they deserve a chance at a national title run or not.\n\nAfter \"Selection Sunday,\" the North Carolina Tar Heels have been the hot controversial topic as college basketball fans dissect the official bracket.\n\nThere was a large contingent that wasn't too happy with the decision by the selection committee on Sunday, as the Tar Heels will play San Diego State to earn a No. 11 seed in the South Region as one of the \"First Four\" games.\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\nBut not everyone was shocked to see the Tar Heels among the 68 teams that got in.\n\nCollege basketball legend Jalen Rose, part of the famous \"Fab Five\" 1991 Michigan Wolverines squad, told Fox News Digital why North Carolina's bid doesn't surprise him at all.\n\n\"They deserve to get in off money and nostalgia,\" Rose said, while also discussing his partnership with Fanatics Sportsbook during this year's March Madness. \"People know how the game works. Since the beginning of time, look at where teams play in the brackets. Duke and Carolina usually play in their own backyard, and it’s not just so they can have the home-court advantage, which it clearly does give them. It also allows the NCAA, or whoever the governing bodies are, to make more money and sell more tickets.\"\n\nNORTH CAROLINA'S NCCA TOURNAMENT BID LEADS TO SOCIAL MEDIA BACKLASH: ‘HOW DID THIS EVEN HAPPEN?’\n\nWhile Rose points out the strong brand UNC has, he also recognized another main factor that led to controversy: Tar Heels athletic director Bubba Cunningham is the chair of the selection committee.\n\nWhile Cunningham said he wasn't in the room for the UNC decision, he deferred to vice chair Keith Gill to explain how the Tar Heels got in.\n\nGill responded, \"Our policies require the AD of any school to recuse themselves and actually leave the room for those discussions. And they're not allowed to participate in any vote as well. ... We voted in four teams in the field on Saturday night, and we had a contingency vote.\n\n\"The contingency vote, that was the last team in the field. And it was based on Memphis-UAB. If Memphis won that game, then that was going to free up a spot in the tournament and that was going to be North Carolina.\"\n\nEither way, Rose explained how he's always been \"skeptical\" with how these committees choose in college sports.\n\n\"I’ve been skeptical about how things have gone down with the NCAA since the beginning of time,\" he admitted. \"How do you put [Cunningham] in that position, and at some point, this doesn’t become a contradiction? That happens on a lot of different levels if that’s the point. So, of course, if he has to wave the flag for a school to get in the NCAA Tournament, there’s something in baseball they use called, ‘Tie goes to the runner.’ That’s what’s going to happen when he’s in position.\n\n\"I’m not saying I like it. I’m saying that’s what it is. The coaches know what it is. The schools know what it is. Media members know what it is, and everybody’s calling it out. And it’s fine.\"\n\nWhy is it fine? Rose doesn't think the Tar Heels are going to be much of a conversation after Tuesday night at UD Arena in Dayton, Ohio.\n\nThe Aztecs are his pick to be that No. 11 seed in the South.\n\n\"Y'all are only going to be able to talk about it for another 24 hours because Brian Dutcher and San Diego State are going to knock them out anyway,\" Rose said.\n\n\"For me, San Diego State would be very poised to beat UNC just because of their defensive prowess, and how they make sure on that end of the floor they’re going to get after it. They’ve been top in the country in all defensive statistical categories, not only this year, but the year they went to the Final Four. I think they’re going to be uniquely poised to take care of business against Carolina.\"\n\nUNC tops SDSU in both NET (36 to 52) and KenPom (33 to 46) ratings, but Rose is leaning on what Dutcher has been able to do with his Aztecs in recent seasons.\n\nSDSU made the Sweet 16 last season before losing to the eventual-champion UConn, and they made the national championship game during the 2022-23 season, falling to the Huskies there as well.\n\nSDSU went 21-9 this season, while UNC was 22-13.\n\nEMBRACING THE CHAOS WITH FANATICS SPORTSBOOK\n\nRose always dreamed of that \"One Shining Moment\" in the NCAA Tournament, which he eventually got with Michigan. But now, he's trying to help sports bettors get their own with Fanatics Sportsbook.\n\nRose's partnership will brings fans into the action and have them \"Embrace the Chaos\" this March with a $5 million FanCash Drop. That means fans who place a $20 parlay on college basketball with Fanatics Sportsbook will win a share of the $5 million FanCash – guaranteed.\n\n\"I’m a participant. So, just like y’all betting that $20, I’m betting it, too! Don’t get it twisted,\" Rose said, laughing. \"I’m betting it, too, and so that’s been a lot of fun for me.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAs someone who admits to betting with friends, family and coworkers with March Madness brackets every year, Rose is excited to participate with the rest of bettors this tournament season.\n\nFinally, Fanatics Sportsbook will be offering a chance for customers to join Rose in San Antonio for the national title game. To enter the sweepstakes, all they have to do is send their parlay slips to Fanatics Sportsbook on social media.\n\n\"I’m so dedicated to Fanatics, and we’re family. We stood on this,\" Rose said. \"We’re going to show you the very unique experience you deserve.\"\n\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.", "link": "https://www.foxnews.com/sports/jalen-rose-reacts-uncs-controversial-tournament-bid-san-diego-state-going-knock-them-out-anyway", "timestamp": "2025-03-17 18:48:28 EDT", "success": true}, "12": {"title": "Challenge Cup draw: Hull FC to face Hull KR in quarter-finals", "summary": "Hull FC will face city rivals Hull KR in the Challenge Cup quarter-finals following their sensational comeback win against holders Wigan Warriors.\n\nJohn Cartwright's side trailed 22-6 at half-time but roared back in the second half to beat the 21-time champions 26-22.\n\nThey will face Hull KR in the last eight at MKM Stadium, after Willie Peters' team cruised past second second-tier Oldham.\n\nThe pair last met in the Challenge Cup in 1986, with their only other previous meeting in the famous Wembley final of 1980.\n\nLast year's beaten finalists Warrington Wolves will host St Helens after beating Widnes Vikings, while 2023 champions Leigh Leopards will face Wakefield Trinity.\n\nThe draw, made live on the BBC, pits 2018 winners Catalans Dragons - who will start as heavy favourites - against Super League strugglers Salford in Perpignan.\n\nAll ties will be played across the weekend of 5 and 6 April.", "link": "https://www.bbc.com/sport/rugby-league/articles/cx291n9ype7o", "timestamp": "2025-03-17 18:47:51 EDT", "success": true}, "13": {"title": "A U.S. airman is charged in death of a South Dakota woman who had vanished in August", "summary": "A U.S. airman is charged in death of a South Dakota woman who had vanished in August\n\ntoggle caption IMAGO/piemags via Reuters\n\nLaw enforcement authorities in South Dakota say a woman who had been missing since last summer was murdered by a member of the U.S. Air Force.\n\nQuinterius Chappelle was arrested on a federal charge of second-degree murder in the death of Sahela Sangrait, according to a social media post by the Pennington County Sheriff's Office. A federal public defender listed for Chappelle declined to comment.\n\nAuthorities say Chappelle, a 24-year-old active-duty airman stationed at Ellsworth Air Force Base, murdered Sangrait on the military installation near Rapid City. Investigators did not say how or when they believe Chappelle killed Sangrait or whether the pair knew each other. Sangrait's remains were found in early March by a hiker in Hill City, nearly 40 miles southwest of the base.\n\nEllsworth Air Force Base did not immediately reply to NPR's request for comment. A spokesperson for the base told the New York Times that Chappelle was an aircraft inspection journeyman for the 28th Aircraft Maintenance Squadron and had entered the service in 2019.\n\nSponsor Message\n\nSangrait, 21, had been missing since August. She was Native American, according to a missing person flyer posted on Facebook. Sangrait had been staying with a friend in Eagle Butte, but was planning to gather some belongings in her hometown of Box Elder, which borders the base, before traveling to California, according to the flyer.\n\nRates of violence and murder against Native American and Alaska Native people in the U.S. — particularly women — are disproportionately high . A Centers for Disease Control and Prevention report found that American Indian and Alaska Native women had the second-highest rate of homicide among American women between 2003 and 2014. In a 2016 study funded by the National Institute of Justice, 84% of American Indian and Alaska Native women said they had experienced violence in their lifetimes — with nearly four in ten saying they had experienced violence in the previous year.\n\nThe National Crime Information Center said in 2016 that there were 5,712 reports of missing American Indian and Alaska Native women and girls across the country. Indigenous people make up about 60% of South Dakota's missing persons cases, South Dakota Searchlight reported in April.\n\nThe Bureau of Indian Affairs Missing and Murdered Unit, which helps analyze and solve cases of American Indian and Alaska Native people who have disappeared or been killed, was part of the investigation into Sangrait's death.\n\nThe Pennington County Sheriff's Office said the case against Chappelle would be prosecuted by the U.S. Attorney's Office for the District of South Dakota, which did not immediately return a message left by NPR.\n\nAs of Monday afternoon, Chappelle was being held in the Pennington County Jail on behalf of the U.S. Marshals Service, according to a county database.", "link": "https://www.npr.org/2025/03/17/nx-s1-5330706/airman-south-dakota-sahela-sangrait-quinterius-chappelle", "timestamp": "2025-03-17 18:41:09 EDT", "success": true}, "14": {"title": "JFK assassination files to be released Tuesday, Trump says", "summary": "President Trump announced that tens of thousands of pages of the JFK assassination files would be released to the public Tuesday.\n\n\"People have been waiting decades for this,\" the president said of the release of files related to the assassination of President John F. Kennedy. Mr. Trump, who was speaking at the Kennedy Center Monday, added that he didn't believe the material, \"approximately 80,000 pages,\" would be redacted.\n\n\"I said during the campaign that I'd do it, and I'm a man of my word,\" the president said of the impending release.\n\nLast month, the FBI said it had discovered roughly 2,400 records related to the assassination during a search stemming from Mr. Trump's executive action ordering files related to the 1963 killing to be declassified.\n\nThe bureau said that the documents, which have been inventoried and digitized, \"were previously unrecognized as related to the JFK assassination case file.\" The FBI in February was transferring the records to the National Archives and Records Administration to be included in the ongoing declassification process that has been ongoing. The bureau did not say what the records contain.\n\nIn his first week in office, Mr. Trump signed an executive order that called for the declassification of these files and also those related to the assassinations of his brother Sen. Robert F. Kennedy and civil rights icon Martin Luther King Jr.\n\nThe order gave the director of national intelligence and attorney general 15 days to present a plan to the president for the \"full and complete release of records\" related to Kennedy's assassination.\n\nCongress in 1992 enacted the President John F. Kennedy Assassination Records Collection Act, which required all assassination-related material be kept in a single collection within the National Archives and be publicly released. The law gave federal agencies 25 years to process and disclose the documents, with exceptions. The collection at the National Archives consists of more than 5 million pages of records.\n\nThe National Archives has over the last three decades made material related to Kennedy's assassination available to the public, with the latest batch disclosed in August 2023. The agency said in December 2022 that more than 97% of records in its Kennedy collection are available to the American people.", "link": "https://www.cbsnews.com/news/jfk-assassination-files-release-trump/", "timestamp": "2025-03-17 18:40:52 EDT", "success": true}, "15": {"title": "Harvard will be free for students whose families make $100,000 or less", "summary": "Harvard will be free for students whose families make $100,000 or less\n\ntoggle caption Maddie Meyer/Getty Images\n\nHarvard University has expanded its financial aid program to make the university free or lower-cost for students whose families earn less than $200,000, a move that comes in the wake of last year's Supreme Court ruling that banned race from being a consideration in the admissions process.\n\n\n\nThree things to know:\n\nHarvard outlined the income requirements for prospective students for the next academic year: If a student's family makes less than $100,000 annually, the cost of attendance is free, including tuition, food, housing, health insurance and travel costs. If a family makes $200,000 or less, tuition is free. Families that make more than that will still qualify to receive financial aid.\n\nThe university described the move as a significant expansion of financial aid that will \"make Harvard affordable to more students than ever, especially from middle-income families.\" The plan also includes a two-part startup grant for graduates to help with the transition to life after Harvard.\n\nHarvard's sticker price for the 2024-2025 school year is an estimated $82,866 for undergraduate students, according to the university's registrar.\n\nSponsor Message\n\nWant just the right amount of economics sent to your inbox weekly? Subscribe to the Planet Money newsletter .\n\nWhat difference does it make?\n\nHarvard has offered free admission in previous years, with the threshold for eligibility increasing several times. The last jump was in 2023, when it was $85,000. The $100,000 family income threshold is well above the median income for the average American household: $80,610, according to 2023 census numbers.\n\nAcross the U.S., more than 100 universities have already adopted similar practices in order to diversify their student bodies. Some smaller schools had been doing it long before the Supreme Court ruling. Others, such as the Massachusetts Institute of Technology, Carnegie Mellon and the University of Pennsylvania more recently have moved to make tuition free or more affordable to families that meet certain income qualifications.\n\nHowever, Zachary Bleemer, an assistant professor of economics at Yale who studies higher education, told NPR via email that, because less than 1% of four-year college students enroll at an Ivy League school to begin with, he doesn't think \"the choice means much for nearly any students.\"\n\n\n\nDive deeper with NPR:", "link": "https://www.npr.org/2025/03/17/nx-s1-5330842/harvard-admission-tuition-free-affirmative-action", "timestamp": "2025-03-17 18:39:55 EDT", "success": true}, "16": {"title": "Columbia activist Mahmoud Khalil describes night of his arrest in new court filing", "summary": "Khalil's attorneys have asked for his return to New York from Louisiana.\n\nMahmoud Khalil speaks to members of media about the Revolt for Rafah encampment at Columbia University during the ongoing conflict between Israel and the Palestinian Islamist group Hamas in Gaza, in New York City, U.S., June 1, 2024. REUTERS/Jeenah Moon/File Photo\n\nMahmoud Khalil speaks to members of media about the Revolt for Rafah encampment at Columbia University during the ongoing conflict between Israel and the Palestinian Islamist group Hamas in Gaza, in New York City, U.S., June 1, 2024. REUTERS/Jeenah Moon/File Photo\n\nMahmoud Khalil speaks to members of media about the Revolt for Rafah encampment at Columbia University during the ongoing conflict between Israel and the Palestinian Islamist group Hamas in Gaza, in New York City, U.S., June 1, 2024. REUTERS/Jeenah Moon/File Photo\n\nMahmoud Khalil speaks to members of media about the Revolt for Rafah encampment at Columbia University during the ongoing conflict between Israel and the Palestinian Islamist group Hamas in Gaza, in New York City, U.S., June 1, 2024. REUTERS/Jeenah Moon/File Photo\n\nThe night federal agents arrested Mahmoud Khalil on Columbia University's campus, the Palestinian activist feared he would be immediately deported, according to a sworn declaration included in a new court filing by his attorneys.\n\nKhalil, a leader of the encampment protests at Columbia last spring, was detained on March 8. He was taken from his student apartment building to 26 Federal Plaza in lower Manhattan, and then to an immigration detention facility in Elizabeth, New Jersey, according to the filing.\n\nA still from a video released by Mahmoud Khalil's attorney of him being detained at Columbia University in New York City on March 8, 2025. Family of Mahmoud Khalil\n\nAfter waiting to enter a processing room, Khalil said he was told \"they don't need you in that room\" and \"you're being transported,\" according to the filing.\n\nTwo agents arrived to escort him to a van, according to the filing.\n\n\"I asked if we were going back to 26 Federal Plaza, and I was told, 'No, we are going to JFK Airport,'\" Khalil said in the filing. \"I was afraid they were trying to deport me.\"\n\nIn the court filing, Khalil's attorneys ask for his return to New York from Louisiana, where he is being held pending an appearance in front of an immigration judge later this month.\n\nHis attorneys had previously asked for his immediate release in a separate filing.\n\nMahmoud Khalil speaks to members of media about the Revolt for Rafah encampment at Columbia University during the ongoing conflict between Israel and the Palestinian Islamist group Hamas in Gaza, in New York City, U.S., June 1, 2024. REUTERS/Jeenah Moon/File Photo Jeenah Moon/Reuters\n\nWhile waiting for the flight to Louisiana, Khalil said he learned the name of one of the agents accompanying him, Abdul, according to his sworn declaration. The other agent wore a Yankees hat, he said.\n\n\"Abdul told me that he was escorting me to Louisiana because 'no one wanted to take it' -- the job of escorting me -- 'because it was a Sunday,'\" he said in the filing.\n\nKhalil's lawyers said that during his detainment, plain-clothed Immigration and Customs Enforcement agents said his student visa had been revoked -- even though Khalil is in the U.S. on a green card. He is married to an American citizen, and he has not been charged with a crime.\n\nOfficials from President Donald Trump's administration have said Khalil was detained for his purported support of Hamas -- a claim his legal team has rejected.\n\nA federal judge has blocked Khalil's removal from the U.S. while weighing a petition challenging his arrest.\n\nHe is set to appear before an immigration judge on March 27.", "link": "https://abcnews.go.com/US/columbia-activist-mahmoud-khalil-recounts-arrest/story?id=119891169", "timestamp": "2025-03-17 18:35:59 EDT", "success": true}, "17": {"title": "Unknown Title", "summary": "Error parsing article content", "link": "https://www.nytimes.com/2025/03/17/us/politics/trump-putin-ceasefire-negotiation-ukraine-concessions.html", "timestamp": "2025-03-17 18:31:33 EDT", "success": false, "error": "Article `download()` failed with 403 Client Error: Forbidden for url: https://www.nytimes.com/2025/03/17/us/politics/trump-putin-ceasefire-negotiation-ukraine-concessions.html on URL https://www.nytimes.com/2025/03/17/us/politics/trump-putin-ceasefire-negotiation-ukraine-concessions.html"}, "18": {"title": "Column: The Trump administration has a free-speech problem", "summary": "I have to wonder: When will Vice President JD Vance condemn his own administration?\n\nLast month, Vance, a self-described foreign policy “realist” who scorns the practice of describing countries as “good guys” and “bad guys,” caused quite a stir at the Munich Security Conference in Germany. He invited controversy, however, not by advocating a more amoral, realpolitik foreign policy but by delivering a finger-wagging, highly moralistic lecture about, among other things, how our allies are insufficiently liberal about free expression. “In Britain, and across Europe, free speech, I fear, is in retreat,” he said more in sorrow than anger.\n\nIn an attempt to seem fair-minded, he even acknowledged that America is not perfect. “And, in the interest of comity, my friends, but also in the interest of truth, I will admit that sometimes the loudest voices for censorship have come not from within Europe but from within my own country, where the prior administration threatened and bullied social media companies to censor so-called misinformation.”\n\nVoices Contributor: The Trump administration schooled Europe on free speech. Why ignore the lesson at home? The actions of the Trump administration’s FTC and FCC are oddly out of step with the positions on free speech JD Vance staked out in Europe last month.\n\nThe implication, of course, was that his own administration would be an unvarnished advocate for, and defender of, the liberal value of free speech.\n\nNow, I should say that I agree with many of Vance’s criticisms of our allies and of the Biden administration. But I think it was bizarre that the man who thinks we should be less judgy about the internal affairs of oppressive regimes chose to sound like a Wilsonian scold to our democratic allies. Suffice it to say that, that just because he was wrong to use that venue to say it, doesn’t mean everything he said was wrong.\n\nAdvertisement\n\nWhat’s more relevant is that it appears he didn’t mean a word of it.\n\nOn Friday, Vance’s boss, President Trump, addressed the staff of the Department of Justice. A large share of the speech was aimed at relitigating his grievances about past investigations into his conduct.\n\nVoices Editorial: Free speech or discrimination? Colleges need help drawing the line Complaints of antisemitism and Islamophobia on campus have skyrocketed. Figuring out when speech is protected or violating the rights of others is no easy task.\n\nThe president displayed the rhetorical discipline and analytical precision he’s famous for, calling various former officials “scum” and the like. Of the judges who ruled contrary to his interests, he said, “It’s not even imaginable how corrupt they were.”\n\nAnd in Trump’s view, that corruption is exacerbated by an equally “really corrupt” media that pressures judges to rule against him. Dubbing the New York Times, Washington Post, Wall Street Journal, NBC, ABC, CBS, CNN and “MSDNC” as “fake news,” he explained that “what they do is illegal.”\n\n“It’s totally illegal what they do,” he said to the assembled prosecutors in the audience. “I just hope you can all watch for it, but it’s totally illegal.” And again : “It has to stop. It has to be illegal. It’s influencing judges and it’s really changing law, and it just cannot be legal. I don’t believe it’s legal.”\n\nSpoiler: It’s legal.\n\nIn short, the president told the nation’s top federal law enforcement officers, who answer to him, that negative coverage of him is illegal as far as he’s concerned and that they should “watch out” for such illegality.\n\nCalifornia Trump opens investigations at three California colleges alleging DEI-based discrimination Amid President Trump’s push against DEI, the Education Department has opened investigations into a diversity-related program it says is connected to three California colleges. The department said it is investigating whether the program amounts to illegal race-based discrimination.\n\nBut it doesn’t end there.\n\nThe president, whose campaign website promised to “end censorship and reclaim free speech,” and who bragged to a joint session of Congress that he “brought free speech back to America,” has launched a fairly massive effort to punish not just protests on America’s college campuses — a cause that arouses some sympathy from me when those protests venture outside the confines of mere speech — but also on school curricula and internal policies .\n\nAdvertisement\n\nHis Department of Justice sent a threatening letter to a member of Congress who criticized Elon Musk.\n\nThe White House has also been scrambling the way the press covers the president, denying the Associated Press access to major events because it won’t call the Gulf of Mexico, the body of water Trump renamed Gulf of America, by its new name.\n\nThe administration committed to fighting “misinformation” and partisan “fake news” has credentialed the most cartoonishly pro-Trump outlets, such as Gateway Pundit, and pillow magnate (and election conspiracy theorist) Mike Lindell’s LindellTV. Meanwhile, over the weekend, Trump issued an order shuttering the Voice of America for being “ anti-Trump .” The VOA was founded with the mission to counter propaganda with factual reporting. It started as a bulwark of truth first against Nazis, but later against authoritarian and totalitarian regimes around the globe.\n\nNow, you don’t have to disagree with all of these moves. But the pattern is hard to square with a vice president who insisted, mostly backed up by a few anecdotes, that the greatest threat to Europe was “the threat from within, the retreat of Europe from some of its most fundamental values” — i.e. from free speech values — “shared by the United States of America.”\n\n@JonahDispatch\n\n", "link": "https://www.latimes.com/opinion/story/2025-03-17/free-speech-jd-vance-munich-donald-trump-department-of-justice", "timestamp": "2025-03-17 18:30:14 EDT", "success": true}, "19": {"title": "Trump says he's ending Secret Service protection for Biden's adult children", "summary": "WASHINGTON (AP) — President Donald Trump said Monday he was ending “immediately” the Secret Service protection details assigned to Democrat Joe Biden's adult children, which the former president had extended to July shortly before leaving office in January.\n\nThe Republican president on social media objected to what he said were 18 agents assigned to Hunter Biden's protective detail while in South Africa this week. He said Ashley Biden has 13 agents assigned to her detail and that she too “will be taken off the list.\"\n\nThere was no immediate reaction from the former president's office.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nFormer presidents and their spouses receive life-long Secret Service protection under federal law, but the protection afforded to their immediate families over the age of 16 ends when they leave office, though both Trump and Biden extended the details for their children for six months before leaving office.\n\nWhile touring the John F. Kennedy Center for the Performing Arts Monday afternoon, a reporter asked Trump if he would revoke the protection for the former president's son.\n\n“Well, we have done that with many. I would say if there are 18 with Hunter Biden, that will be something I’ll look at this afternoon,\" Trump said, who added this was the first time he heard about the matter.\n\n“I’m going to take a look at that,\" he said.", "link": "https://www.yahoo.com/news/trump-says-hes-ending-secret-222920353.html", "timestamp": "2025-03-17 18:29:20 EDT", "success": true}, "20": {"title": "Lionel Messi: Argentina leave Inter Miami forward out of next World Cup qualifiers", "summary": "Inter Miami forward Lionel Messi has been left out of Argentina's squad for their next two World Cup qualifiers.\n\nThe 37-year-old returned to Miami's starting line-up for their Major League Soccer win over Atlanta United but reportedly picked up an injury during Sunday's game.\n\nMessi was rested for three Miami games before coming off the bench and scoring in last week's Concacaf Champions Cup win at Jamaican side Cavalier.\n\nArgentina can secure qualification for next year's World Cup in this round of games as the holders visit Uruguay and host Brazil.\n\nThey lead South America's 10-team qualifying group by five points from Uruguay with six games remaining, with Brazil seven points adrift in fifth.\n\nThe top six qualify automatically for the 2026 World Cup while the seventh-placed team goes into a play-off.\n\nAfter 12 rounds, Messi is the top scorer with six goals, taking his overall tally to 112 from 191 international appearances.\n\nArgentina will also be without injured Roma striker Paulo Dybala and River Plate full-back Gonzalo Montiel.\n\nBrazil will be without Messi's former Barcelona team-mate Neymar as a thigh injury has denied the Santos forward, 33, a return to the national team.", "link": "https://www.bbc.com/sport/football/articles/cx2814gx3lwo", "timestamp": "2025-03-17 18:28:12 EDT", "success": true}}}
